In [2]:
%load_ext sql

In [3]:
%env DATABASE_URL=postgresql://postgres:mMPR85ZV6psocMUPR98DDKWz@localhost/food_claims_datacamp_cert

env: DATABASE_URL=postgresql://postgres:mMPR85ZV6psocMUPR98DDKWz@localhost/food_claims_datacamp_cert

In [5]:
%sql select * from claims limit 5

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
5 rows affected.

[('0000000-00.2016.0.00.0019', Decimal('1614'), 'R$40,000.00', Decimal('19311.26'), 'SAO LUIS', Decimal('1'), 'FALSE', None, 2016, Decimal('19')),
 ('0000000-00.2016.0.00.0027', Decimal('1728'), 'R$48,872.00', Decimal('36432.29'), 'SAO LUIS', Decimal('2'), 'FALSE', None, 2016, Decimal('27')),
 ('0000000-00.2016.0.00.0090', Decimal('1696'), 'R$40,000.00', Decimal('23605.38'), 'SAO LUIS', Decimal('1'), 'FALSE', None, 2016, Decimal('90')),
 ('0000000-00.2016.0.00.0025', Decimal('1573'), 'R$200,000.00', Decimal('150832.19'), 'RECIFE', Decimal('8'), 'FALSE', 'vegetables', 2016, Decimal('25')),
 ('0000000-00.2017.0.00.0029', Decimal('1126'), 'R$88,282.00', Decimal('50867.69'), 'SAO LUIS', Decimal('3'), 'FALSE', None, 2017, Decimal('29'))]

tras primer vistazo de la base de datos se identifico que el campo "claim_id" esta compuesto por el a√±o del claim en conjunto de lo que pareciera ser un consecutivo. **Se procede a manipular el mismo**.

In [9]:
##verificar que no hayan duplicados del campo claim_id 
%sql select claim_id, count(*) from claims group by 1 having count(*) >1;

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
0 rows affected.

[]

In [11]:
##debido a que no se especifica como fue el metodo de data entry del dataset. Se corre query para descartar errores de espacios en el campo de interes claim_id

%sql update claims set claim_id=trim(claim_id);

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
98 rows affected.

[]

In [13]:
## extraer el dato de interes del string "claim_id"

%sql select *, split_part(claim_id,'.',5) as claim_number, split_part(claim_id,'.',2) as year from claims limit 5;

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
5 rows affected.

[('0000000-00.2016.0.00.0019', Decimal('1614'), 'R$40,000.00', Decimal('19311.26'), 'SAO LUIS', Decimal('1'), 'FALSE', None, '0019', '2016'),
 ('0000000-00.2016.0.00.0027', Decimal('1728'), 'R$48,872.00', Decimal('36432.29'), 'SAO LUIS', Decimal('2'), 'FALSE', None, '0027', '2016'),
 ('0000000-00.2016.0.00.0090', Decimal('1696'), 'R$40,000.00', Decimal('23605.38'), 'SAO LUIS', Decimal('1'), 'FALSE', None, '0090', '2016'),
 ('0000000-00.2016.0.00.0025', Decimal('1573'), 'R$200,000.00', Decimal('150832.19'), 'RECIFE', Decimal('8'), 'FALSE', 'vegetables', '0025', '2016'),
 ('0000000-00.2017.0.00.0029', Decimal('1126'), 'R$88,282.00', Decimal('50867.69'), 'SAO LUIS', Decimal('3'), 'FALSE', None, '0029', '2017')]

Se suman dos columnas a la base de datos, year y claim_number ambos extraidos de la columna "claim_id"

In [16]:
%sql ALTER TABLE claims ADD COLUMN year smallint, ADD COLUMN claim_number numeric

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
Done.

[]

In [19]:
%sql update claims set year=split_part(claim_id,'.',2)::numeric

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
98 rows affected.

[]

In [ ]:
%sql update claims set claim_number=split_part(claim_id,'.',5)::numeric

El segundo campo a trabajar es "claim_amount". Ya que el mismo tiene el prefijo "R$" que es LC de Brasil, y por ende y hacer las modificaciones para que el campo sea reconocido como numeric.

In [16]:
%sql update claims set claim_amount=sub.new_amount2 from (with cte as (select claim_id, substring(claim_amount,3) new_amount from claims),cte2 as (select claim_id, split_part(new_amount,',',1) || split_part(new_amount,',',2) new_amount2 from cte) select claim_id, new_amount2 from cte2) as sub where claims.claim_id=sub.claim_id;

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
98 rows affected.

[]

In [25]:
##modificar el data type del campo "claim_amount"
%sql ALTER TABLE claims ALTER COLUMN claim_amount TYPE numeric USING claim_amount::numeric;

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
Done.

[]

In [26]:
%sql select * from claims limit 5;

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
5 rows affected.

[('0000000-00.2016.0.00.0019', Decimal('1614'), Decimal('40000'), Decimal('19311.26'), 'SAO LUIS', Decimal('1'), 'FALSE', None, 2016, Decimal('19')),
 ('0000000-00.2016.0.00.0027', Decimal('1728'), Decimal('48872'), Decimal('36432.29'), 'SAO LUIS', Decimal('2'), 'FALSE', None, 2016, Decimal('27')),
 ('0000000-00.2016.0.00.0090', Decimal('1696'), Decimal('40000'), Decimal('23605.38'), 'SAO LUIS', Decimal('1'), 'FALSE', None, 2016, Decimal('90')),
 ('0000000-00.2016.0.00.0025', Decimal('1573'), Decimal('200000'), Decimal('150832.19'), 'RECIFE', Decimal('8'), 'FALSE', 'vegetables', 2016, Decimal('25')),
 ('0000000-00.2017.0.00.0029', Decimal('1126'), Decimal('88282'), Decimal('50867.69'), 'SAO LUIS', Decimal('3'), 'FALSE', None, 2017, Decimal('29'))]